# Add repositories for fonts and specific applications
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "socsieng/tap"
tap "jesseduffield/lazydocker"

# Install command-line tools and applications
brew "ansible" # 自动化配置管理工具
brew "bat" # 'cat' 命令的增强版，带有语法高亮和Git集成
brew "black" # for neovim
brew "btop" # 系统监视工具，类似于 'htop')
brew "cloudflared" # Cloudflare Tunnel client (formerly Argo Tunnel
brew "cmake" # 跨平台的安装（编译）软件
brew "erlang" # Programming language for highly scalable real-time systems
brew "fastfetch" # 类似于 neofetch 的系统信息工具，但更快
brew "fd" # 简单、快速和用户友好的文件查找替代品
brew "ffmpeg" # 完整的跨平台解决方案，用于录制、转换视频和音频流
brew "flac" # 自由无损音频编码器
brew "fzf" # 命令行模糊查找工具
brew "gh" # GitHub 的命令行工具，用于操作仓库
brew "git" # 分布式版本控制系统
brew "gnupg" # 完整的和自由的实现PGP标准的软件
brew "go" # Go编程语言
brew "htop" # 交互式进程查看器
brew "jq" # 命令行 JSON 处理器
brew "lazydocker" # Docker 的简化命令行界面
brew "lazygit" # Git的简化命令行界面
brew "lsd" # 带有大量特色和美化的 'ls' 命令
brew "luarocks" # for neovim
brew "neovim" # Vim 文本编辑器的现代化分支
brew "node" # JavaScript 运行时环境
brew "pandoc" # Swiss-army knife of markup format conversion
brew "prettier" # Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML. For neovim
brew "pyenv" # Python 版本管理
brew "python" # Python 编程语言
brew "pyvim" # for neovim
brew "ripgrep" # for neovim
brew "ruby" # Ruby 编程语言
brew "rust" # Rust 编程语言
brew "shfmt" # Autoformat shell script source code
brew "sleepwatcher", restart_service: true # Monitors sleep, wakeup, and idleness of a Mac
brew "starship" # 用于各种 shell 的快速、可定制的提示符
brew "stylua" # for neovim
brew "subversion" # Version control system designed to be a better CVS
brew "thefuck" # 纠正您之前命令行中的错误
brew "tmux" # 终端复用器
brew "tree-sitter" # for neoivm
brew "wakeonlan" # Sends magic packets to wake up network-devices
brew "wget" # 网络下载工具
brew "yadm" # 管理 dotfiles 的工具
brew "zoxide" # 更智能的目录跳转工具，替代 'cd'
brew "zsh" # 强大的shell
brew "jesseduffield/lazydocker/lazydocker" # Docker 的简化命令行界面，从自定义 tap 安装
brew "socsieng/tap/sendkeys" # Command-line tool for automating keystrokes and mouse events

# Install applications via Homebrew Cask
cask "alacritty" # GPU 加速的终端模拟器
cask "android-platform-tools" # Android 平台工具，如 adb 和 fastboot
cask "bleunlock" # Lock/unlock Apple computers using the proximity of a bluetooth low energy device
cask "brave-browser" # 重视隐私的网络浏览器
cask "docker" # 容器化技术工具
# cask "chromium" # 开源网页浏览器
cask "font-hack" # 专为编程设计的字体
cask "font-hack-nerd-font" # Hack 字体的 Nerd Fonts 版本
cask "font-iosevka" # 定制的编程字体
cask "font-iosevka-nerd-font" # Iosevka 字体的 Nerd Fonts 版本
cask "font-jetbrains-mono" # JetBrains Mono，JetBrains 创建的开源字体
cask "font-jetbrains-mono-nerd-font" # JetBrains Mono 的 Nerd Fonts 版本
cask "font-meslo-for-powerline" # 字体
cask "google-chrome" # 谷歌网络浏览器
cask "google-drive" # 谷歌云端硬盘客户端
cask "logseq" # 基于 Markdown 的知识库和笔记应用
cask "microsoft-excel" # 微软 Excel
cask "obsidian" # 基于 Markdown 的知识管理和笔记软件
cask "orbstack" # 虚拟机工具
cask "steam" # 游戏平台
cask "telegram-desktop" # Telegram 桌面版
cask "visual-studio-code" # 微软的源代码编辑器
cask "vlc" # 多媒体播放器
cask "warp" # 终端应用

# vscode
vscode "4ops.terraform"
vscode "alefragnani.project-manager"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "chun.vscode-translate"
vscode "darkcwk.youdao"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "genieai.chatgpt-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "intellsmi.comment-translate"
vscode "jithurjacob.nbpreviewer"
vscode "kiteco.kite"
vscode "maptz.regionfolder"
vscode "michelemelluso.code-beautifier"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mushan.vscode-paste-image"
vscode "naumovs.color-highlight"
vscode "panicbit.cargo"
vscode "pkief.material-icon-theme"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "samhurne.vscode-teraterm-lang"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "whizkydee.material-palenight-theme"
vscode "yokoe.vscode-postfix-go"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
